CSI API ETABS v1
cPointElm.GetLoadDispl Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetLoadDispl(
	string Name,
	ref int NumberItems,
	ref string[] PointName,
	ref string[] LoadPat,
	ref int[] LcStep,
	ref string[] CSys,
	ref double[] U1,
	ref double[] U2,
	ref double[] U3,
	ref double[] R1,
	ref double[] R2,
	ref double[] R3,
	eItemTypeElm ItemTypeElm = eItemTypeElm.Element
)
Function GetLoadDispl (
	Name As String,
	ByRef NumberItems As Integer,
	ByRef PointName As String(),
	ByRef LoadPat As String(),
	ByRef LcStep As Integer(),
	ByRef CSys As String(),
	ByRef U1 As Double(),
	ByRef U2 As Double(),
	ByRef U3 As Double(),
	ByRef R1 As Double(),
	ByRef R2 As Double(),
	ByRef R3 As Double(),
	Optional ItemTypeElm As eItemTypeElm = eItemTypeElm.Element
) As Integer
Dim instance As cPointElm
Dim Name As String
Dim NumberItems As Integer
Dim PointName As String()
Dim LoadPat As String()
Dim LcStep As Integer()
Dim CSys As String()
Dim U1 As Double()
Dim U2 As Double()
Dim U3 As Double()
Dim R1 As Double()
Dim R2 As Double()
Dim R3 As Double()
Dim ItemTypeElm As eItemTypeElm
Dim returnValue As Integer
returnValue = instance.GetLoadDispl(Name,
	NumberItems, PointName, LoadPat,
	LcStep, CSys, U1, U2, U3, R1, R2, R3,
	ItemTypeElm)
int GetLoadDispl(
	String^ Name,
	int% NumberItems,
	array<String^>^% PointName,
	array<String^>^% LoadPat,
	array<int>^% LcStep,
	array<String^>^% CSys,
	array<double>^% U1,
	array<double>^% U2,
	array<double>^% U3,
	array<double>^% R1,
	array<double>^% R2,
	array<double>^% R3,
	eItemTypeElm ItemTypeElm = eItemTypeElm::Element
)
abstract GetLoadDispl :
        Name : string *
        NumberItems : int byref *
        PointName : string[] byref *
        LoadPat : string[] byref *
        LcStep : int[] byref *
        CSys : string[] byref *
        U1 : float[] byref *
        U2 : float[] byref *
        U3 : float[] byref *
        R1 : float[] byref *
        R2 : float[] byref *
        R3 : float[] byref *
        ?ItemTypeElm : eItemTypeElm
(* Defaults:
        let _ItemTypeElm = defaultArg ItemTypeElm eItemTypeElm.Element
*)
-> int
Parameters
Name
Type: System.String
NumberItems
Type: System.Int32
PointName
Type: System.String[]
LoadPat
Type: System.String[]
LcStep
Type: System.Int32[]
CSys
Type: System.String[]
U1
Type: System.Double[]
U2
Type: System.Double[]
U3
Type: System.Double[]
R1
Type: System.Double[]
R2
Type: System.Double[]
R3
Type: System.Double[]
ItemTypeElm (Optional)
Type: ETABSv1.eItemTypeElm
Return Value
Type: Int32
See Also
Reference
cPointElm Interface
ETABSv1 Namespace